Repository: sunxinglin/CM-PR-NE252014-YN-Module-Vision
Catalog: Src/VisDummy.Lang/Resources/Language.*.resx
Languages: id

# 登录
source: Login
id: Masuk

# 日志消息
source: Log Message
id: Pesan Log

# 清屏
source: Clear Screen
id: Bersihkan Layar

# 筛选
source: Filter
id: Saring

# 当前账号
source: Current Account
id: Akun Saat Ini

# 当前密码
source: Current Password
id: Kata Sandi Saat Ini

# 新密码
source: New Password
id: Kata Sandi Baru

# 新密码(二次输入)
source: New Password (Re-enter)
id: Kata Sandi Baru (Masukan Kembali)

# 重置表单
source: Reset Form
id: Reset Formulir

# 修改密码
source: Change Password
id: Ubah Kata Sandi

# 账号名
source: Account Name
id: Nama Akun

# 密码
source: Password
id: Kata Sandi

# 密码(二次确认)
source: Password (Confirm)
id: Konfirmasi Kata Sandi (Kedua Kali)

# 姓名
source: Name
id: Nama

# 工卡
source: Work Card
id: Kartu Karyawan

# 角色
source: Role
id: Peran

# 创建用户
source: Create User
id: Buat Pengguna

# 名称
source: Name
id: Nama

# 权限
source: Permissions
id: Hak Akses

# 更新
source: Update
id: Perbarui

# 账号
source: Account
id: Akun

# 操作
source: Operation
id: Operasi

# 删除
source: Delete
id: Hapus

# 当前页码
source: Current Page
id: Halaman Saat Ini

# 总页数
source: Total Pages
id: Total Halaman

# 上一页
source: Previous Page
id: Halaman Sebelumnya

# 下一页
source: Next Page
id: Halaman Berikutnya

# 刷新
source: Refresh
id: Segarkan

# 用户操作
source: User Operation
id: Operasi Pengguna

# 切换用户
source: Switch User
id: Ganti Pengguna

# 注销(切换成操作员)
source: Logout (Switch to Operator)
id: Keluar (Ganti menjadi Operator)

# 管理权限
source: Admin Permissions
id: Kelola Hak Akses

# 系统用户
source: System User
id: Pengguna Sistem

# 刷卡登录
source: Card Login
id: Masuk dengan Menggosok Kartu

# 请刷卡登录
source: Please Swipe Card to Login
id: Silakan Masuk dengan Menggosok Kartu

# 密码登录
source: Password Login
id: Masuk dengan Kata Sandi

# 取消
source: Cancel
id: Batalkan

# 正在退出请勿强行关闭
source: Exiting, Do Not Force Close
id: Sedang Keluar, Jangan Tutup Secara Paksa:

# 请稍等
source: Please Wait...
id: Silakan Tunggu...

# 设备ID
source: Device ID:
id: ID Perangkat:

# 操作者
source: Operator:
id: Penyelenggara:

# 已登录时间
source: Logged-in Time:
id: Waktu Telah Masuk:

# 用户管理
source: Users
id: Pengelolaan Pengguna

# 参数设置
source: Parameter
id: Pengaturan Parameter

# 生产管理
source: Production
id: Pengelolaan Produksi

# 调试工具
source: Debug Tools
id: Alat Pengujian

# 连接参数
source: Connection Parameters
id: Parameter Koneksi

# 接口参数
source: Interface Parameters
id: Parameter Antarmuka

# 保存
source: Save
id: Simpan

# 首件调用
source: First Piece Call
id: Pemanggilan Barang Pertama

# 值
source: Value
id: Nilai

# 流程
source: Process
id: Proses

# 选择流程
source: Select Process
id: Pilih Proses

# 说明
source: Description
id: Keterangan

# 步长
source: Step Size
id: Langkah

# 九点标定
source: Nine-point Calibration
id: Kalibrasi Sembilan Titik

# 旋转中心
source: Rotation Center
id: Titik Pusat Putar

# 禁止编辑
source: Edit Disabled
id: Dilarang Diedit

# 触发拍照
source: Trigger Capture
id: Pemicu Foto

# 功能号
source: Function Number
id: Nomor Fungsi

# 点检
source: Spot Check
id: Pemeriksaan Rutin

# 拍照次数
source: Capture Count
id: Jumlah Foto

# 拍照位置
source: Capture Position
id: Lokasi Foto

# 视觉方案
source: Vision Solution
id: Skema Visual

# N点标定
source: N-point Calibration
id: Kalibrasi N Titik

# MES配置
source: MES Configuration
id: Konfigurasi MES

# MES测试
source: MES Test
id: Pengujian MES

# VM全局变量
source: VM Global Variables
id: Variabel Global VM

# 通用状态
source: General Status
id: Status Umum

# 维护模式
source: Maintenance Mode
id: Mode Perawatan

# 心跳响应
source: Heartbeat Response
id: Respons Denyut Jantung

# 心跳请求
source: Heartbeat Request
id: Permintaan Denyut Jantung

# Msg_请输入密码
source: Please Enter Password
id: Silakan Masukkan Kata Sandi

# Msg_新密码不得为空
source: New Password Cannot Be Empty
id: Kata Sandi Baru Tidak Boleh Kosong

# Msg_两次输入的密码必须一致
source: Passwords Must Match
id: Kedua Kali Masukan Kata Sandi Harus Sama

# Msg_账号名不可为空
source: Account Name Cannot Be Empty!
id: Nama Akun Tidak Boleh Kosong!

# Msg_当前密码不可为空
source: Current Password Cannot Be Empty!
id: Kata Sandi Saat Ini Tidak Boleh Kosong!

# Msg_新密码不可为空
source: New Password Cannot Be Empty!
id: Kata Sandi Baru Tidak Boleh Kosong!

# Msg_已修改密码
source: Password Changed
id: Kata Sandi Telah Diubah

# Msg_名称不可为空
source: Name Cannot Be Empty
id: Nama Tidak Boleh Kosong

# Msg_密码与工卡不可均为空
source: Password and Work Card Cannot Both Be Empty
id: Kata Sandi dan Kartu Karyawan Tidak Boleh Kedua-duanya Kosong

# Msg_已创建用户
source: User Created
id: Pengguna Telah Dibuat

# Msg_删除账户成功
source: Account Deleted Successfully
id: Penghapusan Akun Berhasil

# Msg_删除账户完成
source: Account Deletion Completed
id: Penghapusan Akun Selesai

# Msg_已删除用户
source: User Deleted
id: Pengguna Telah Dihapus

# Msg_删除账户错误
source: Account Deletion Error
id: Kesalahan Penghapusan Akun

# Msg_已修改权限分配
source: Permission Assignment Modified
id: Penugasan Hak Akses Telah Diubah

# Msg_切换到用户失败请检查服务器是否启动或操作员凭据
source: Failed to Switch User, Check Server or Operator Credentials
id: Gagal Beralih ke Pengguna, Silakan Periksa Apakah Server Sudah Dimulai atau Kredensial Operator

# Msg_保存成功
source: Save Successful
id: Simpan Berhasil

# Msg_当前INI文件不含有首件的配置段
source: Current INI File Does Not Contain First Piece Configuration Section
id: File INI Saat Ini Tidak Memiliki Bagian Konfigurasi Barang Pertama

# Msg_首件参数变动
source: First Piece Parameters Changed
id: Perubahan Parameter Barang Pertama

# Msg_修改前
source: Before Modification
id: Sebelum Diubah

# Msg_全局参数变动
source: Global Parameters Changed
id: Perubahan Parameter Global

# Msg_设置全局变量失败
source: Failed to Set Global Variables
id: Gagal Mengatur Variabel Global

# Msg_获取全局变量功能类失败
source: Failed to Get Global Variable Function Class
id: Gagal Mendapatkan Kelas Fungsi Variabel Global

# Msg_无法加载3D视觉控制器
source: Failed to Load 3D Vision Controller
id: Tidak Dapat Memuat Pengontrol Visual 3D

# Msg_流程未注册或未注册成
source: Process Not Registered or Registration Failed
id: Proses Belum Terdaftar atau Belum Terdaftar

# Msg_3D视觉拍照状态码异常
source: 3D Vision Capture Status Code Abnormal
id: Kode Status Foto Visual 3D Ber 异常

# Msg_加载流程失败
source: Failed to Load Process
id: Gagal Memuat Proses

# Msg_已登录
source: Logged In
id: Telah Masuk

# Msg_正常工作拍照
source: Normal Work Capture
id: Foto Kerja Normal

# Msg_视觉输入参数
source: Vision Input Parameters
id: Parameter Masukan Visual

# Msg_拍照失败
source: Capture Failed
id: Gagal Foto

# Msg_拍照成功
source: Capture Successful
id: Foto Berhasil

# Msg_初始化
source: Initialization
id: Inisialisasi

# 全局变量
source: Global Variables
id: Variabel Global

# Msg_收到PLC拍照请求
source: Received PLC Capture Request
id: Menerima Permintaan Foto PLC

# Msg_PLC参数错误
source: PLC Parameter Error
id: Kesalahan Parameter PLC

# Msg_向PLC写数据错误
source: Error Writing Data to PLC
id: Kesalahan Menulis Data ke PLC

# Msg_MST信号为空将从PLC重新读取
source: MST Signal Empty, Re-reading from PLC...
id: Sinyal MST Kosong, Akan Dibaca Ulang dari PLC...

# Msg_MST信号已从PLC恢复
source: MST Signal Restored from PLC
id: Sinyal MST Telah Dikembalikan dari PLC

# 类型
source: Type
id: Tipe

# Msg_系统错误
source: System Error
id: Kesalahan Sistem

# 视觉监控
source: Vision Monitoring
id: Pengawasan Visual

# 点位监控-大包装
source: Position Monitoring - Large Package
id: Pengawasan Titik - Kemasan Besar

# 视觉工作拍照请求
source: Vision Work Capture Request
id: Permintaan Foto Kerja Visual

# 视觉工作拍照响应
source: Vision Work Capture Response
id: Respons Permintaan Foto Kerja Visual

# 响应OK
source: Response OK
id: Respons OK

# 响应NG
source: Response NG
id: Respons NG

# 工程状态
source: Project Status
id: Status Proyek

# 泡棉状态
source: Foam Status
id: Status Busi

# 电芯列数
source: Battery Cell Columns
id: Jumlah Kolom Sel Baterai

# 来料方向
source: Material Direction
id: Arah Masuk Bahan

# 标定球拍照请求
source: Calibration Ball Capture Request
id: Permintaan Foto Bola Kalibrasi

# 标定球拍照完成请求
source: Calibration Ball Capture Complete Request
id: Permintaan Selesai Foto Bola Kalibrasi

# Msg_标定球拍照请求
source: Calibration Ball Capture Request
id: Permintaan Foto Bola Kalibrasi

# 标定球拍照响应
source: Calibration Ball Capture Response
id: Respons Foto Bola Kalibrasi

# 报警代码
source: Alarm Code
id: Kode Alarm

# 电芯码
source: Battery Cell Code
id: Kode Sel Baterai

# 精度校验拍照请求
source: Accuracy Verification Capture Request
id: Permintaan Foto Pemeriksaan Ketepatan

# 相机号
source: Camera Number
id: Nomor Kamera

# 精度校验拍照响应
source: Accuracy Verification Capture Response
id: Respons Foto Pemeriksaan Ketepatan

# 特征大小
source: Feature Size
id: Ukuran Ciri

# 像素精度
source: Pixel Accuracy
id: Ketepatan Piksel

# Msg_精度校验
source: Accuracy Verification
id: Pemeriksaan Ketepatan

# 风冷片有无
source: Presence of Air Cooling Plate
id: Apakah Ada Lembar pendingin angin

# 极性结果
source: Polarity Result
id: Hasil Polaritas

# 点位监控-模组检测
source: Position Monitoring - Module Detection
id: Pengawasan Titik - Pemeriksaan Modul

# 点位监控-模组贴标
source: Position Monitoring - Module Labeling
id: Pengawasan Titik - Pelabelan Modul

# 点位监控-垫片检测
source: Position Monitoring - Spacer Detection
id: Pengawasan Titik - Pemeriksaan Saku Busi

# 点位监控-模组入箱
source: Position Monitoring - Module Boxing
id: Pengawasan Titik - Penyimpanan Modul ke Kotak

# 泡棉层高
source: Foam Layer Height
id: Tinggi Lapisan Busi

# 模组类型
source: Module Type
id: Tipe Modul

# 日志查询
source: Log Query
id: Kueri Log

# 运行日志
source: Running Log
id: Jalankan Log

# PLC日志
source: PLC Log
id: Catatan PLC

# 报警日志
source: Alarm Log
id: Catatan Alarm
